Revit 2027 API
ConceptualSurfaceType.DefaultConstructionTypeId Property
 The element id of the user specified ConceptualConstructionType to be used by default on creation for mass faces of this mass subcategory.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DefaultConstructionTypeId { get; set; }
Public Property DefaultConstructionTypeId As ElementId
	Get
	Set
public:
property ElementId^ DefaultConstructionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DefaultConstructionTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input element is not a constructionType.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace